students = ["철수","민수","영희","다래"]
subjects = ["국어","영어","수학"]
scores = [["민수","수학",25],
          ["다래","수학",80],
          ["영희","국어",40],
          ["철수","수학",80],
          ["철수","국어",20],
          ["다래","영어",80],
          ["영희","수학",64],
          ["민수","국어",100],
          ["민수","영어",100],
          ["철수","영어",50],
          ["영희","영어",100],
          ["다래","국어",90]]

# 위와 같이 리스트가 주어졌을 때, 학생명과 과목명에 따라 분류된 Dict로 만드세요.
# 결과값>>
# {'철수': {'국어': 20, '영어': 50, '수학': 80},
#  '민수': {'국어': 100, '영어': 100, '수학': 25},
#  '영희': {'국어': 40, '영어': 100, '수학': 64},
#  '다래': {'국어': 90, '영어': 80, '수학': 80}}



output = {n : {su:sc[2] for su in subjects for sc in scores if sc[0]==n and sc[1]==su} for n in students}
print(output)
